Revit 2027 API
BuiltInFailures.AutoRouteFailures.ElementHasFlowCalculation Property
 This element has an open connection. This may not be an error, but for flow calculations to work correctly all connections should be sealed with an end cap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementHasFlowCalculation { get; }
Public Shared ReadOnly Property ElementHasFlowCalculation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementHasFlowCalculation {
	FailureDefinitionId^ get ();
}
static member ElementHasFlowCalculation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace